<details><summary>tf plan (nonprod):</summary>

```terraform

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_sql_server.sqlserver will be created
  + resource "azurerm_sql_server" "sqlserver" {
      + administrator_login          = "demoadmin"
      + administrator_login_password = (sensitive value)
      + connection_policy            = "Default"
      + extended_auditing_policy     = (known after apply)
      + fully_qualified_domain_name  = (known after apply)
      + id                           = (known after apply)
      + location                     = "eastus2"
      + name                         = "kjadev-server"
      + resource_group_name          = "kjadev"
      + version                      = "12.0"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>